telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Utilities/PC_Software/STM32H7RSxx.svd
          <register>
            <name>FLASH_ROTSR</name>
            <displayName>FLASH_ROTSR</displayName>
            <description>FLASH RoT status register</description>
            <addressOffset>0x208</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>OEM_PROVD</name>
                <description>OEM provisioned device
Any other value: device is not provisioned by the OEM.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>Device has been provisioned by the OEM</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_AUTH</name>
                <description>Debug authentication method
Any other value: no authentication method selected (NotSet).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>Locked device (no debug allowed)</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x51</name>
                    <description>Authentication method using ECDSA signature (NIST P256)</description>
                    <value>0x51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8A</name>
                    <description>Authentication method using password</description>
                    <value>0x8A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6F</name>
                    <description>Delegated debug (to OEM iRoT code in user Flash)</description>
                    <value>0x6F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IROT_SELECT</name>
                <description>iRoT selection
This option is ignored for STM32H7R devices (OEM iRoT is always selected).
Any other value: OEM iRoT is selected at boot.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>ST iRoT is selected at boot</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_ROTSRP</name>
            <displayName>FLASH_ROTSRP</displayName>
            <description>FLASH RoT status register programming</description>
            <addressOffset>0x20C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>OEM_PROVD</name>
                <description>OEM provisioned device
Write to change corresponding bits in FLASH_ROTSR register.
Write are ignored if HDPL is greater than 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_AUTH</name>
                <description>Debug authentication method programming
Write to change corresponding bits in FLASH_ROTSR register.
Write are ignored if HDPL is greater than 0.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IROT_SELECT</name>
                <description>iRoT selection
This option is ignored for STM32H7R devices.
Write to change corresponding bits in FLASH_ROTSR register.
Write are ignored if HDPL is greater than 1 and if NVSTATE is not 0xB4 (OPEN).</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPLSR</name>
            <displayName>FLASH_OTPLSR</displayName>
			<description>FLASH OTP lock status register</description>
            <addressOffset>0x210</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>OTPL</name>
                <description>OTP lock n
Block n corresponds to OTP 16-bit word 32 x n to 32 x n + 31.
OTPL[n] = 1 indicates that all OTP 16-bit words in OTP Block n are locked and can no longer be programmed.
OTPL[n] = 0 indicates that all OTP 16-bit words in OTP Block n are not locked and can still be modified.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPLSRP</name>
            <displayName>FLASH_OTPLSRP</displayName>
            <description>FLASH OTP lock status register programming</description>
            <addressOffset>0x214</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>OTPL</name>
                <description>OTP lock n programming
Write to change corresponding option byte bit in FLASH_OTPLSR.
OTPL bits can be only be set, not cleared.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSR</name>
            <displayName>FLASH_WRPSR</displayName>
            <description>FLASH write protection status register</description>
            <addressOffset>0x218</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>WRPS</name>
                <description>Write protection for sector n
This bit reflects the write protection status of user Flash sector n</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sector n is write protected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector n is not write protected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSRP</name>
            <displayName>FLASH_WRPSRP</displayName>
            <description>FLASH write protection status register programming</description>
            <addressOffset>0x21C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>WRPS</name>
                <description>Write protection for sector n programming
Write to change corresponding bit in FLASH_WRPSR</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDPSR</name>
            <displayName>FLASH_HDPSR</displayName>
            <description>FLASH hide protection status register</description>
            <addressOffset>0x230</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xF000FFFF</resetMask>
            <fields>
              <field>
                <name>HDP_AREA_START</name>
                <description>Hide protection user Flash area start
This option sets the start address that contains the first 256-byte block of the hide protection (HDP) area in user Flash area.
If HDP_AREA_END=HDP_AREA_START all the sectors are protected.
If HDP_AREA_END&lt;HDP_AREA_START no sectors are protected.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP_AREA_END</name>
                <description>Hide protection user Flash area end
This option sets the end address that contains the last 256-byte block of the hide protection (HDP) area in user Flash area.
If HDP_AREA_END=HDP_AREA_START all the sectors are protected.
If HDP_AREA_END&lt;HDP_AREA_START no sectors are protected.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDPSRP</name>
            <displayName>FLASH_HDPSRP</displayName>
            <description>FLASH hide protection status register programming</description>
            <addressOffset>0x234</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xF000FFFF</resetMask>
            <fields>
              <field>
                <name>HDP_AREA_START</name>
                <description>Hide protection user Flash area start programming
Write to change corresponding option byte bits in FLASH_HDPSR.
If HDP_AREA_END=HDP_AREA_START all the sectors are protected.
If HDP_AREA_END&lt;HDP_AREA_START no sectors are protected.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HDP_AREA_END</name>
                <description>Hide protection user Flash area end programming
Write to change corresponding option byte bits in FLASH_HDPSR.
If HDP_AREA_END=HDP_AREA_START all the sectors are protected.
If HDP_AREA_END&lt;HDP_AREA_START no sectors are protected.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_FIXEDSR</name>
            <displayName>FLASH_FIXEDSR</displayName>
            <description>FLASH fixed bank status register</description>
            <addressOffset>0x248</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFF0F000</resetMask>
            <fields>
              <field>
                <name>NUM_FIXED_SECT</name>
                <description>Number of fixed sectors
The value set in this bitfield (adding one 0 as LSB) defines the even number of sectors that are not affected by the SWAP_BANK bit. For example, if NUM_FIXED_SECT=100 the number of fixed sectors is 0b1000, i.e. eight.
This option is meaningful only when EN_SWAP_BANK option bit is set.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EN_SWAP_BANK</name>
                <description>Enable swap bank
For the sectors not allocated to bank F using NUM_FIXED_SECT bits they are managed according to this bit value:</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>All sectors not assigned to bank F are allocated to bank A. Accessing to bank B sectors return a bus error, and erase request to those sectors are ignored.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>All sectors not assigned to bank F are evenly allocated between bank A and bank B, based on SWAP_BANK option bit.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK_FIXED</name>
                <description>Lock fixed bank parameters
When set writes to FLASH _FIXEDSRP are ignored.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_EPOCHSR</name>
            <displayName>FLASH_EPOCHSR</displayName>
            <description>FLASH epoch status register</description>
            <addressOffset>0x250</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>EPOCH</name>
                <description>Epoch
This value is distributed by hardware to the SAES peripheral.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_EPOCHSRP</name>
            <displayName>FLASH_EPOCHSRP</displayName>
            <description>FLASH RoT status register programming</description>
            <addressOffset>0x254</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0000</resetMask>
            <fields>
              <field>
                <name>EPOCH</name>
                <description>Epoch programming
Write to change corresponding bits in FLASH_EPOCHSR register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
