telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Utilities/PC_Software/STM32H7RSxx.svd
          <register>
            <name>FLASH_OBW1SR</name>
            <displayName>FLASH_OBW1SR</displayName>
            <description>FLASH option byte word 1 status register</description>
            <addressOffset>0x260</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>BOR_LEV</name>
                <description>Brownout level
These bits reflects the power level that generates a system reset.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>BOR OFF, POR/PDR reset threshold level is applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>BOR Level 1, the threshold level is low (around 2.1 V)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>BOR Level 2, the threshold level is medium (around 2.4 V)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>BOR Level 3, the threshold level is high (around 2.7 V)</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_HW</name>
                <description>Independent watchdog HW Control</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>IWDG watchdog is controlled by software</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>IWDG watchdog is controller by hardware</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STOP</name>
                <description>Reset on stop mode</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent WDG generates a reset if STOP mode is requested</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent WDG does not generate a reset if STOP mode is requested</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NRST_STBY</name>
                <description>Reset on standby mode</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent WDG generates a reset if STANDBY mode is requested</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent WDG does not generate a reset if STANDBY mode is requested</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OCTO1_HSLV</name>
                <description>XSPIM_P1 High-Speed at Low-Voltage</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O XSPIM_P1 High-Speed option disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O XSPIM_P1 High-Speed option enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OCTO2_HSLV</name>
                <description>XSPIM_P2 High-Speed at Low-Voltage</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O XSPIM_P2 High-Speed option disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O XSPIM_P2 High-Speed option enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_FZ_STOP</name>
                <description>IWDG stop mode freeze
When set the independent watchdog IWDG is frozen in system Stop mode.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in Stop mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in Stop mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IWDG_FZ_SDBY</name>
                <description>IWDG standby mode freeze
When set the independent watchdog IWDG is frozen in system Standby mode.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Independent watchdog frozen in Standby mode</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Independent watchdog keep running in Standby mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERSO_OK</name>
                <description>Personalization OK
This bit is set on STMicroelectronics production line.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VDDIO_HSLV</name>
                <description>I/O High-Speed at Low-Voltage
This bit indicates that the product operates below 2.5 V.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Product working in the full voltage range, I/O speed optimization at low-voltage disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Product operating below 2.5 V, I/O speed optimization at low-voltage feature allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OBW1SRP</name>
            <displayName>FLASH_OBW1SRP</displayName>
            <description>FLASH option byte word 1 status register programming</description>
            <addressOffset>0x264</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>BOR_LEV</name>
                <description>Brownout level
Write to change corresponding bits in FLASH_OBW1SR register.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IWDG_HW</name>
                <description>Independent watchdog HW Control
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NRST_STOP</name>
                <description>Reset on stop mode programming
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NRST_STBY</name>
                <description>Reset on standby mode programming
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OCTO1_HSLV</name>
                <description>XSPIM_P1 High-Speed at Low-Voltage
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OCTO2_HSLV</name>
                <description>XSPIM_P2 High-Speed at Low-Voltage programming
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IWDG_FZ_STOP</name>
                <description>IWDG stop mode freeze
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IWDG_FZ_SDBY</name>
                <description>IWDG standby mode freeze programming
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>VDDIO_HSLV</name>
                <description>I/O High-Speed at Low-Voltage programming
Write to change corresponding bit in FLASH_OBW1SR register.</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OBW2SR</name>
            <displayName>FLASH_OBW2SR</displayName>
            <description>FLASH option byte word 2 status register</description>
            <addressOffset>0x268</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>ITCM_AXI_SHARE</name>
                <description>ITCM SRAM configuration</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DTCM_AXI_SHARE</name>
                <description>DTCM SRAM configuration</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ECC_ON_SRAM</name>
                <description>ECC on SRAM</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>I2C_NI3C</name>
                <description>I2C Not I3C</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I3C is selected</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I2C is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OBW2SRP</name>
            <displayName>FLASH_OBW2SRP</displayName>
            <description>FLASH option byte word 2 status register programming</description>
            <addressOffset>0x26C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>ITCM_AXI_SHARE</name>
                <description>ITCM AXI share programming
Write to change corresponding bits in FLASH_OBW2SR register.
Bit 2 should be kept to 0:
ITCM_AXI_SHARE: = “000” or “011”: ITCM 64 Kbytes
ITCM_AXI_SHARE = “001”: ITCM 128 Kbytes
ITCM_AXI_SHARE = “010”: ITCM 192 Kbytes</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DTCM_AXI_SHARE</name>
                <description>DTCM AXI share programming
Write to change corresponding bits in the FLASH_OBW2SR register.
Bit 2 should be kept to 0:
DTCM_AXI_SHARE = “000” or “011”: DTCM 64 Kbytes
DTCM_AXI_SHARE = “001”: DTCM 128 Kbytes
DTCM_AXI_SHARE = “010”: DTCM 192 Kbytes</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ECC_ON_SRAM</name>
                <description>ECC on SRAM programming
Write to change corresponding bit in FLASH_OBW2SR register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>I2C_NI3C</name>
                <description>I2C Not I3C
Write to change corresponding bit in FLASH_OBW2SR register.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
