telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Utilities/PC_Software/STM32H7RSxx.svd
	  </registers>
    </peripheral>
	<peripheral>
      <name>RCC</name>
      <description>RCC</description>
      <groupName>RCC</groupName>
      <baseAddress>0x58024400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC</name>
        <description>RCC interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000025</resetValue>
          <fields>
            <field>
              <name>HSION</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIKERON</name>
              <description></description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDY</name>
              <description></description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIDIV</name>
              <description></description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HSIDIVF</name>
              <description></description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSION</name>
              <description></description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDY</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSIKERON</name>
              <description></description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48ON</name>
              <description></description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDY</name>
              <description></description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEON</name>
              <description></description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDY</name>
              <description></description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <description></description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEEXT</name>
              <description></description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSECSSON</name>
              <description></description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1ON</name>
              <description></description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDY</name>
              <description></description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL2ON</name>
              <description></description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDY</name>
              <description></description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3ON</name>
              <description></description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDY</name>
              <description></description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CKPROTR</name>
          <displayName>CKPROTR</displayName>
          <description>RCC clock protection regsiter</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XSPICKP</name>
              <description>XSPI clock protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCCKP</name>
              <description>FMC clock protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1SWP</name>
              <description>XSPI1 kernel clock switch position</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XSPI2SWP</name>
              <description>XSPI2 kernel clock switch position</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FMCSWP</name>
              <description>FMC kernel clock switch position</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSICFGR</name>
          <displayName>HSICFGR</displayName>
          <description>RCC HSI calibration register</description>
          <addressOffset>0x004</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x40000</resetValue>
          <fields>
            <field>
              <name>HSICAL</name>
              <description>HSICAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>HSITRIM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRRCR</name>
          <displayName>CRRCR</displayName>
          <description>RCC clock recovery RC register</description>
          <addressOffset>0x008</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSI48CAL</name>
              <description>HSI48CAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSICFGR</name>
          <displayName>CSICFGR</displayName>
          <description>RCC CSI calibration register</description>
          <addressOffset>0x00C</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>CSICAL</name>
              <description>CSICAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CSITRIM</name>
              <description>CSITRIM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>RCC clock configuration register</description>
          <addressOffset>0x010</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW</name>
              <description>SW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
                <access>read-only</access>
            </field>
            <field>
              <name>STOPWUCK</name>
              <description>STOPWUCK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPKERWUCK</name>
              <description>STOPWUCK</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCPRE</name>
              <description>RTCPRE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TIMPRE</name>
              <description>TIMPRE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCO1PRE</name>
              <description>MCO1PRE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1SEL</name>
              <description>MCO1SEL</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <description>MCO2PRE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2SEL</name>
              <description>MCO2SEL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDCFGR</name>
          <displayName>CDCFGR</displayName>
          <description>RCC CPU domain clcok configuration register</description>
          <addressOffset>0x018</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPRE</name>
              <description>CPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCFGR</name>
          <displayName>BMCFGR</displayName>
          <description>RCC AHB configuration register</description>
          <addressOffset>0x01C</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMPRE</name>
              <description>BMPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCFGR</name>
          <displayName>APBCFGR</displayName>
          <description>RCC APB clocks configuration register</description>
          <addressOffset>0x020</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPRE1</name>
              <description>PPRE1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PPRE2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PPRE4</name>
              <description>PPRE4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PPRE5</name>
              <description>PPRE5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCKSELR</name>
          <displayName>PLLCKSELR</displayName>
          <description>RCC PLL clock source selection register</description>
          <addressOffset>0x028</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x02020200</resetValue>
          <fields>
            <field>
              <name>PLLSRC</name>
              <description>PLLSRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIVM1</name>
              <displayName>DIVM1</displayName>
              <description>prescaler for PLL1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM2</name>
              <displayName>DIVM2</displayName>
              <description>prescaler for PLL2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM3</name>
              <displayName>DIVM3</displayName>
              <description>prescaler for PLL3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>RCC PLLs configuration register</description>
          <addressOffset>0x02C</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLL1FRACLE</name>
              <displayName>PLL1FRACLE</displayName>
              <description>PLL1 fractionnal latch enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1VCOSEL</name>
              <displayName>PLL1VCOSEL</displayName>
              <description>PLL1 VCO Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1SSCGEN</name>
              <displayName>PLL1SSCGEN</displayName>
              <description>PLL1 SSCG enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RGE</name>
              <displayName>PLL1RGE</displayName>
              <description>PLL1 input frequency range</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL1DIVPEN</name>
              <displayName>PLL1DIVPEN</displayName>
              <description>PLL1 DIVP divider output enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1DIVQEN</name>
              <displayName>PLL1DIVQEN</displayName>
              <description>PLL1 DIVQ divider output enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1DIVREN</name>
              <displayName>PLL1DIVREN</displayName>
              <description>PLL1 DIVR divider output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1DIVSEN</name>
              <displayName>PLL1DIVSEN</displayName>
              <description>PLL1 DIVS divider output enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1DIVTEN</name>
              <displayName>PLL1DIVTEN</displayName>
              <description>PLL1 DIVT divider output enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2FRACLE</name>
              <displayName>PLL2FRACLE</displayName>
              <description>PLL2 fractionnal latch enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2VCOSEL</name>
              <displayName>PLL2VCOSEL</displayName>
              <description>PLL2 VCO Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2SSCGEN</name>
              <displayName>PLL2SSCGEN</displayName>
              <description>PLL2 SSCG enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RGE</name>
              <displayName>PLL2RGE</displayName>
              <description>PLL2 input frequency range</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL2DIVPEN</name>
              <displayName>PLL2DIVPEN</displayName>
              <description>PLL2 DIVP divider output enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2DIVQEN</name>
              <displayName>PLL2DIVQEN</displayName>
              <description>PLL2 DIVQ divider output enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2DIVREN</name>
              <displayName>PLL2DIVREN</displayName>
              <description>PLL2 DIVR divider output enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2DIVSEN</name>
              <displayName>PLL2DIVSEN</displayName>
              <description>PLL2 DIVS divider output enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2DIVTEN</name>
              <displayName>PLL2DIVTEN</displayName>
              <description>PLL2 DIVT divider output enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3FRACLE</name>
              <displayName>PLL3FRACLE</displayName>
              <description>PLL3 fractionnal latch enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3VCOSEL</name>
              <displayName>PLL3VCOSEL</displayName>
              <description>PLL3 VCO Selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3SSCGEN</name>
              <displayName>PLL3SSCGEN</displayName>
              <description>PLL3 SSCG enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RGE</name>
              <displayName>PLL3RGE</displayName>
              <description>PLL3 input frequency range</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL3DIVPEN</name>
              <displayName>PLL3DIVPEN</displayName>
              <description>PLL3 DIVP divider output enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3DIVQEN</name>
              <displayName>PLL3DIVQEN</displayName>
              <description>PLL3 DIVQ divider output enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3DIVREN</name>
              <displayName>PLL3DIVREN</displayName>
              <description>PLL3 DIVR divider output enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3DIVSEN</name>
              <displayName>PLL3DIVSEN</displayName>
              <description>PLL3 DIVS divider output enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3DIVTEN</name>
              <displayName>PLL3DIVTEN</displayName>
              <description>PLL3 DIVT divider output enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
