telespial/EdgeAI_Video_Soot_Detector_demo_STM32H7S78-DK/firmware/STM32H7S78-DK-USB-Demo-Source/Utilities/PC_Software/STM32H7RSxx.svd
        <register>
          <name>PLL1DIVR1</name>
          <displayName>PLL1DIVR1</displayName>
          <description>RCC PLL1 divider configuration register 1</description>
          <addressOffset>0x030</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <displayName>DIVP</displayName>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <displayName>DIVQ</displayName>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <displayName>DIVR</displayName>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1DIVR2</name>
          <displayName>PLL1DIVR2</displayName>
          <description>RCC PLL1 divider configuration register 2</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>DIVS</name>
              <description>DIVS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DIVT</name>
              <displayName>DIVT</displayName>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1FRACR</name>
          <displayName>PLL1FRACR</displayName>
          <description>RCC PLL1 fractional divider register</description>
          <addressOffset>0x034</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1SSCGR</name>
          <displayName>PLL1SSCGR</displayName>
          <description>PLL1 Spred Spectrum Clock Generator register</description>
          <addressOffset>0x0cc</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>MOD_PER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TPDFN_DIS1</name>
              <description>TPDFN_DIS1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPDFN_DIS1</name>
              <description>RPDFN_DIS1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DWNSPREAD1</name>
              <description>DWNSPREAD1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>INC_STEP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>PLL2DIVR1</name>
          <displayName>PLL2DIVR1</displayName>
          <description>RCC PLL2 dividers configuration register 1</description>
          <addressOffset>0x038</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <displayName>DIVP</displayName>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <displayName>DIVQ</displayName>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <displayName>DIVR</displayName>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR2</name>
          <displayName>PLL2DIVR2</displayName>
          <description>RCC PLL2 divider configuration register 2</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>DIVS</name>
              <description>DIVS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DIVT</name>
              <displayName>DIVT</displayName>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2FRACR</name>
          <displayName>PLL2FRACR</displayName>
          <description>RCC PLL2 fractional divider register</description>
          <addressOffset>0x03C</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2SSCGR</name>
          <displayName>PLL2SSCGR</displayName>
          <description>PLL2 Spred Spectrum Clock Generator register</description>
          <addressOffset>0x0d0</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>MOD_PER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TPDFN_DIS1</name>
              <description>TPDFN_DIS1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPDFN_DIS1</name>
              <description>RPDFN_DIS1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DWNSPREAD1</name>
              <description>DWNSPREAD1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>INC_STEP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR1</name>
          <displayName>PLL3DIVR1</displayName>
          <description>RCC PLL3 divider configuration register 1</description>
          <addressOffset>0x040</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x01010280</resetValue>
          <fields>
            <field>
              <name>DIVN</name>
              <description>DIVN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DIVP</name>
              <displayName>DIVP</displayName>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVQ</name>
              <displayName>DIVQ</displayName>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>DIVR</name>
              <displayName>DIVR</displayName>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR2</name>
          <displayName>PLL3DIVR2</displayName>
          <description>RCC PLL3 divider configuration register 2</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000101</resetValue>
          <fields>
            <field>
              <name>DIVS</name>
              <description>DIVS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DIVT</name>
              <displayName>DIVT</displayName>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3FRACR</name>
          <displayName>PLL3FRACR</displayName>
          <description>RCC PLL3 fractional divider register</description>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRACN</name>
              <description>FRACN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3SSCGR</name>
          <displayName>PLL3SSCGR</displayName>
          <description>PLL3 Spred Spectrum Clock Generator register</description>
          <addressOffset>0x0d4</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>MOD_PER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>TPDFN_DIS1</name>
              <description>TPDFN_DIS1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPDFN_DIS1</name>
              <description>RPDFN_DIS1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DWNSPREAD1</name>
              <description>DWNSPREAD1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>INC_STEP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <displayName>CCIPR1</displayName>
          <description>RCC AHB peripheral kernel clock selection register</description>
          <addressOffset>0x04c</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000A00</resetValue>
          <fields>
            <field>
              <name>FMCSEL</name>
              <description>FMCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SDMMCSEL</name>
              <description>SDMMCSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1SEL</name>
              <description>XSPI1SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>XSPI2SEL</name>
              <description>XSPI2SEL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USBREFCKSEL</name>
              <description>USBREFCKSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USBPHYCSEL</name>
              <description>USBPHYCSEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTGFSSEL</name>
              <description>OTGFSSEL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ETH1REFCKSEL</name>
              <description>ETH1REFCKSEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ETH1PHYCKSEL</name>
              <description>ETH1PHYCKSEL</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1SEL</name>
              <description>ADF1SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADCSEL</name>
              <description>ADCSEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PSSISEL</name>
              <description>PSSISEL</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKPERSEL</name>
              <description>CKPERSEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <displayName>CCIPR2</displayName>
          <description>RCC APB1 peripheral kernel clock selection register</description>
          <addressOffset>0x050</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UART234578SEL</name>
              <description>UART234578SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI23SEL</name>
              <description>SPI23SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C23SEL</name>
              <description>I2C23SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>I2C1_I3C1SEL</name>
              <description>I2C1_I3C1SEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCANSEL</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPDIFRXSEL</name>
              <description>SPDIFRXSEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CECSEL</name>
              <description>CECSEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <displayName>CCIPR3</displayName>
          <description>RCC APB2 peripheral kernel clock selection register</description>
          <addressOffset>0x054</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI45SEL</name>
              <description>SPI45SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI1SEL</name>
              <description>SPI1SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SAI1SEL</name>
              <description>SAI1SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SAI2SEL</name>
              <description>SAI2SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR4</name>
          <displayName>CCIPR4</displayName>
          <description>RCC APB4,5 peripheral kernel clock selection register</description>
          <addressOffset>0x058</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPUART1SEL</name>
              <description>LPUART1SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPI6SEL</name>
              <description>SPI6SEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM23SEL</name>
              <description>LPTIM23SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LPTIM45SEL</name>
              <description>LPTIM45SEL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>RCC clock source interrupt enable register</description>
          <addressOffset>0x060</addressOffset>
          <size>0x20</size>
          <access></access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSIRDYIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSERDYIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSIRDYIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSERDYIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIRDYIE</name>
              <description>CSIRDYIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <description>HSI48RDYIE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RDYIE</name>
              <description>PLL1RDYIE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RDYIE</name>
              <description>PLL2RDYIE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RDYIE</name>
              <description>PLL3RDYIE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSECSSIE</name>
              <description>LSECSSIE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
